In [0]:
from google.colab import drive
drive.mount('/content/gdrive')
%cd /content/gdrive/My Drive/Colab Notebooks/LIPNLP

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).
/content/gdrive/My Drive/Colab Notebooks/LIPNLP

In [0]:
import pandas as pd
import numpy as np
import dateutil
import cv2

from sklearn import preprocessing

import matplotlib.pyplot as plt
plt.style.use('seaborn')

In [0]:
market = pd.read_csv('prices/apple_market.csv')
market['date'] = pd.to_datetime(market['date'])
market.head()

        date       open       high        low      close     volume
0 2006-12-01  13.114285  13.190000  12.871428  13.045714  198769900
1 2006-12-04  13.125714  13.150000  12.928572  13.017143  177384200
2 2006-12-05  13.092857  13.190000  12.981428  13.038571  165709600
3 2006-12-06  12.948571  13.055715  12.810000  12.832857  159546100
4 2006-12-07  12.861428  12.928572  12.414286  12.434286  251206900

In [0]:
news_array = np.load('news_data.npy', allow_pickle=True)
news = pd.DataFrame(news_array, columns=['date', 'news'])
news['date'] = pd.to_datetime(news['date'])
news.head()

        date                                               news
0 2006-12-01  whats tonight 8 pm tlc ashley judd youthaids c...
1 2006-12-04  housing prices broadest government measure hou...
2 2006-12-05                                               news
3 2006-12-06  honoring rw apple words food 1000 rw apple ’ a...
4 2006-12-07  homebuilders worries jobs lead decline stocks ...

In [0]:
len(news)

2517

In [0]:
charts = pd.read_csv('charts/chart.csv')
charts['chart_image'] = [cv2.cvtColor(plt.imread(im,0), cv2.COLOR_BGR2GRAY) for im in charts['image_list']]
charts['date'] = pd.to_datetime(charts['date'])

charts.head()

   Unnamed: 0  ...                                        chart_image
0           0  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
1           1  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
2           2  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
3           3  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
4           4  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...

[5 rows x 4 columns]

In [0]:
len(charts)

2507

In [0]:
df = market.merge(news, how='inner', right_index=True, left_index=False, on='date')
df.head()

        date  ...                                               news
0 2006-12-01  ...  whats tonight 8 pm tlc ashley judd youthaids c...
1 2006-12-04  ...  housing prices broadest government measure hou...
2 2006-12-05  ...                                               news
3 2006-12-06  ...  honoring rw apple words food 1000 rw apple ’ a...
4 2006-12-07  ...  homebuilders worries jobs lead decline stocks ...

[5 rows x 8 columns]

In [0]:
df = df.merge(charts, how='inner', right_index=True, left_index=False, on='date')
df = df.reset_index()
df.head()

   index  ...                                        chart_image
0     10  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
1     11  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
2     12  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
3     13  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...
4     14  ...  [[255, 255, 255, 255, 255, 255, 255, 255, 255,...

[5 rows x 12 columns]

In [0]:
df = market
day5change = [df.iloc[x+5,1] for x in range(len(df)-5)]
day5change.extend([0,0,0,0,0])
df['5D_change'] = day5change

df.head(10)

        date       open       high        low      close     volume  5D_change
0 2006-12-01  13.114285  13.190000  12.871428  13.045714  198769900  12.461429
1 2006-12-04  13.125714  13.150000  12.928572  13.017143  177384200  12.700000
2 2006-12-05  13.092857  13.190000  12.981428  13.038571  165709600  12.658571
3 2006-12-06  12.948571  13.055715  12.810000  12.832857  159546100  12.564285
4 2006-12-07  12.861428  12.928572  12.414286  12.434286  251206900  12.721429
5 2006-12-08  12.461429  12.770000  12.428572  12.608571  196069300  12.717143
6 2006-12-11  12.700000  12.757143  12.578571  12.678572  124945100  12.518572
7 2006-12-12  12.658571  12.691428  12.218572  12.305715  256655000  12.104285
8 2006-12-13  12.564285  12.724286  12.450000  12.721429  214263000  12.352858
9 2006-12-14  12.721429  12.857142  12.608571  12.650000  208082700  12.100000

In [0]:
df = df[['date', 'volume', 'high', 'low', '5D_change']]
df = df.iloc[10:len(df)-5,]
df.head(10)

         date     volume       high        low  5D_change
10 2006-12-15  184984800  12.745714  12.475715  11.922857
11 2006-12-18  180394200  12.571428  12.084286  11.735714
12 2006-12-19  227851400  12.382857  11.945714  11.164286
13 2006-12-20  141922900  12.381429  12.105714  11.460000
14 2006-12-21  225899800  12.211429  11.742857  11.992857
15 2006-12-22  153325900  12.005714  11.657143  12.327143
16 2006-12-26  122672200  11.795714  11.555715  12.007143
17 2006-12-27  483938700  11.714286  10.967143  12.252857
18 2006-12-28  279969200  11.607142  11.378572  12.280000
19 2006-12-29  269107300  12.200000  11.908571  12.350000

In [0]:
x = np.array(df[['volume', 'high', 'low']])
y = np.array(df['5D_change'])

std_scale = preprocessing.StandardScaler().fit(x)
x = std_scale.transform(x)

In [0]:
x

array([[ 0.50903257, -1.33702755, -1.33051248],
       [ 0.46271123, -1.34181754, -1.34143563],
       [ 0.94157698, -1.34700013, -1.3453026 ],
       ...,
       [-1.07069102,  1.35070213,  1.38149736],
       [-1.06225841,  1.39055313,  1.39126435],
       [-1.0955479 ,  1.40237104,  1.43005347]])

In [0]:
#saving data to numpy arrays for future use

np.save('stock_data', x)
np.save('targets', y)